Revit 2027 API
StructuralSectionAnalysisParams.ElasticModulusStrongAxis Property
 Elastic section modulus about main strong axis for calculation of bending stresses.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ElasticModulusStrongAxis { get; set; }
Public Property ElasticModulusStrongAxis As Double
	Get
	Set
public:
property double ElasticModulusStrongAxis {
	double get ();
	void set (double value);
}
member ElasticModulusStrongAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace